class CONSTANTS:
    APP_TITLE = 'Расчет естественной вентиляции. Версия 1.0.0'
    TAB1_TITLE = "Расчет"
    TAB2_TITLE = "Справочные данные"

    ACCELERATION_OF_GRAVITY = 9.81

    class INIT_DATA:
        TITLE = 'Исходные данные'
        LINE_HEIGHT = 35
        INPUT_WIDTH = 70
        LABELS = (
            ('Расчетная температура внутреннего воздуха,\ntв', '°C'),
            ('Коэффициент эквивалентной шероховатости\nканала, Kэ', 'мм'),
            ('Высота типового этажа, hэ', 'м'),
            ('Высота шахты, Hш', 'м'),
        )
        KLAPAN_LABEL = 'Выбор воздушного клапана'
        KLAPAN_ITEMS = {
                'AB': 31,
                'КИВ': 38,
                'AirBox': 42,
                'Другой': '--',
            }
        KLAPAN_INPUT_LABEL_1 = 'Расход воздуха через клапан при перепаде\nдавления 10 Па'
        KLAPAN_INPUT_TOOLTIP = 'Активируется при выборе\nвоздушного клапана <Другой>'


    class BUTTONS:
        TITLE = 'Действия'
        DELETE_BUTTON_TITLE = 'Удалить\nэтаж'
        ADD_BUTTON_TITLE = 'Добавить\nэтаж'
        LAST_FLOOR_BUTTON_TITLE = 'Добавить\nпоследний этаж'

        DELETE_BUTTON_TOOLTIP = 'Удалить текущую строку основного расчёта'
        ADD_BUTTON_TOOLTIP = 'Добавить строку в конец основного расчёта'


    class MAIN_TABLE:
        TITLE = 'Основной расчёт'
        NAME = 'main'
        HEADER = [
            'Этаж',
            'Высота\nэтажа\n[м]',
            'Участок',
            'L\n[м3/ч]',
            'H\n[м]',
            'Pгр\n[Па]',
            'Рдеф\n[Па]',
            'Ррасп\n[Па]',
            'ζпр',
            'ζотв',
            'Сторона канала\na\n(большая)\n[мм]',
            'Сторона канала\nb\n(меньшая)\n[мм]',
            'v\n[м/с]',
            'dэкв\n[м]',
            'R\n[Па/м]',
            'm',
            'R∙l∙m\n[Па]',
            'Рд\n[Па]',
            'ΔPпр\n[Па]',
            'ΔPотв\n[Па]',
            'ΔP\n[Па]',
            'Результат',
        ]


    class SPUTNIK_TABLE:
        TITLE = 'Расчёт спутника'
        NAME = 'sputnik'
        HEADER = [
            'Участок',
            'Проектный\nрасход\nчерез\nклапана\nL\n[м3/ч]',
            'Длина\nканала\n[м]',
            'Сторона канала\na\n(большая)\n[мм]',
            'Сторона канала\nb\n(меньшая)\n[мм]',
            'v\n[м/с]',
            'dэкв\n[м]',
            'R\n[Па/м]',
            'm',
            'R∙l∙m\n[Па]',
            'Рд\n[Па]',
            '∑ζ',
            'Z\n[Па]',
            'Z+R∙l∙m\n[Па]',
            'Выбор\nрасчёта',
        ]
        RADIO_TOOLTIP_1 = 'Расчёт одностороннего блока'
        RADIO_TOOLTIP_2 = 'Расчёт двухстороннего блока'


    class REFERENCE_DATA:
        class M:
            X = [100, 150, 200, 250, 300, 350, 400, 450, 500, 550, 600, 650, 700, 750, 800, 900, 1000, 1500]  # 18
            Y = [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000, 1500]  # 11
            line_1 = [1.13,1.15,1.2,1.25,1.3,1.35,1.4,1.45,1.5,1.55,1.6,1.65,1.7,1.75,1.8,1,1,1]
            line_2 = [1.2,1.145,1.13,1.145,1.16,1.18,1.2,1.23,1.25,1.27,1.3,1.33,1.36,1.39,1.41,1.46,1.51,1.75]
            line_3 = [1.3,1.2,1.16,1.14,1.13,1.14,1.148,1.165,1.175,1.195,1.21,1.22,1.245,1.26,1.275,1.32,1.355,1.54]
            line_4 = [1.4,1.265,1.2,1.17,1.148,1.137,1.13,1.137,1.145,1.149,1.16,1.165,1.17,1.185,1.2,1.225,1.25,1.38]
            line_5 = [1.5,1.345,1.25,1.205,1.175,1.1505,1.145,1.135,1.13,1.135,1.14,1.145,1.15,1.155,1.165,1.18,1.2,1.3]
            line_6 = [1.6,1.405,1.3,1.25,1.21,1.18,1.16,1.148,1.14,1.135,1.13,1.135,1.138,1.144,1.148,1.155,1.17,1.25]
            line_7 = [1.7,1.48,1.36,1.29,1.245,1.21,1.17,1.16,1.15,1.145,1.138,1.135,1.13,1.132,1.138,1.145,1.15,1.22]
            line_8 = [1.8,1.55,1.41,1.33,1.275,1.24,1.2,1.18,1.165,1.15,1.148,1.141,1.138,1.138,1.13,1.138,1.146,1.2]
            line_9 = [1,1.6,1.46,1.38,1.32,1.27,1.225,1.2,1.18,1.17,1.155,1.149,1.145,1.147,1.138,1.13,1.137,1.17]
            line_10 = [1,1.68,1.51,1.42,1.355,1.3,1.25,1.225,1.2,1.18,1.17,1.16,1.15,1.146,1.146,1.137,1.13,1.155]
            line_11 = [1,1,1.75,1.62,1.54,1.46,1.38,1.345,1.3,1.275,1.25,1.23,1.22,1.2,1.2,1.17,1.155,1.13]
            TABLE = [line_1, line_2, line_3, line_4, line_5, line_6, line_7, line_8, line_9, line_10, line_11]


        class KMS_BRANCH:
            X_L = [0,0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,1]
            Y_F = [0.1,0.2,0.4,0.6,0.8,1]
            line_1 = [0.3,0.3,0.9,1,1,1,1,1,1,1,1]
            line_2 = [-1.7,-1.7,0.6,1,1,1,1,1,1,1,1]
            line_3 = [-2.4,-2.4,-0.6,0.7,1,1.1,1.1,1.1,1.1,1.1,1.1]
            line_4 = [-21,-21,-2.7,0.1,0.9,1.1,1.1,1.2,1.2,1.2,1.2]
            line_5 = [-37,-37,-5.5,-0.7,0.6,1.1,1.2,1.3,1.3,1.2,1.2]
            line_6 = [-50,-50,-8.8,-1.7,0.3,1.1,1.3,1.3,1.3,1.3,1.3]
            TABLE = [line_1, line_2, line_3, line_4, line_5, line_6]


        class KMS_PASS:
            X_L = [0,0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,1]
            Y_F = [0.1,0.2,0.4,0.6,0.8,1]
            line_1 = [0.2,0.2,0.5,0.9,1.5,2.5,4.4,8.4,20,82,10000000]
            line_2 = [0.2,0.2,0.4,0.8,1.3,2.1,3.7,7.1,16.7,69,10000000]
            line_3 = [0.2,0.2,0.4,0.6,1,1.6,2.8,5.2,12.3,51,10000000]
            line_4 = [0.2,0.2,0.4,0.6,0.8,1.3,2.2,4.1,9.5,39,10000000]
            line_5 = [0.8,0.8,0.4,0.5,0.7,1.1,1.8,3.3,7.6,31,10000000]
            line_6 = [0.3,0.3,0.4,0.5,0.7,1,1.6,2.8,6.3,2.5,10000000]
            TABLE = [line_1, line_2, line_3, line_4, line_5, line_6]


        class DEFLECTOR_PRESSURE_RELATION:
            X = [0, 0.05, 0.1, 0.15, 0.2, 0.25, 0.3, 0.35, 0.4, 0.45, 0.5]
            TABLE = [0.55, 0.48, 0.43, 0.38, 0.35, 0.32, 0.28, 0.24, 0.21, 0.16, 0.1]


    class DEFLECTOR:
        TITLE = 'Расчёт дефлектора'
        NAME = 'deflector'
        HEADER = [
            'Скорость ветра Vв [м/с]',
            'Рекомендуемая скорость в патрубке дефлектора Vд.рек [м/с]',
            'Расход воздуха L [м3/ч]',
            'Требуемая площадь патрубка дефлектора Fрек [м2]',
            'Диаметр дефлектора [мм]',
            'Фактическая скорость в патрубке дефлектора Vд.факт [м/с]',
            'Отношение Vд.факт / Vв',
            'Отношение Pд / Pв',
            'Разрежение в патрубке дефлектора Pд [Па]',
        ]
        DIAMETERS = {
            0.007854: '100',
            0.012272: '125',
            0.020106: '160',
            0.031416: '200',
            0.049087: '250',
            0.077931: '315',
            0.125664: '400',
            0.19635: '500',
            0.311725: '710',
            0.395919: '800',
        }
